<!--------------------Підключення до бази даних Client_request-------------------->
<?php
    $serverName = "localhost"; //змінна, що містить адресу веб-сервера із базою даних
    $userName = "root"; //змінна, що містить ім'я користувача
    $password = ""; //змінна, що місить пароль
    $database = "dymar"; //змінна, що містить навзу бази даних до якої підключаємось
    
    //змінна, котра містить з'єднання з базою даних
    //використовуємо функцію mysqli_connect(), у якому передаємо в якості параметрів попередньо описані змінні
    $connect = mysqli_connect ($serverName, $userName, $password, $database);
    
    //перевірка на помилки з підключенням   
    if ($connect == false) {
        die ('Connection Error!'); //функція die() припиняє виконання коду, що йде після неї
    }
?>